scottstamp/darts/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"

# CPU Frequency Boost (240 MHz Max Performance)
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ=240

# Compiler Optimization (Optimize for Performance -O2, enable ccache)
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_CCACHE_ENABLE=y

# Memory & PSRAM Configuration (Octal 80MHz DDR)
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_CAPS_ALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=16384

# Flash Configuration (Quad I/O 80MHz)
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

# FreeRTOS & System
CONFIG_FREERTOS_HZ=1000
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# CONFIG_LCD_RGB_RESTART_IN_VSYNC is not set (Causes vertical shifting & glitching on ST7701S panel)

# Enable LVGL Built-in Fonts for UI text & badges
CONFIG_LV_FONT_MONTSERRAT_18=y
CONFIG_LV_FONT_MONTSERRAT_24=y
CONFIG_LV_FONT_MONTSERRAT_32=y
CONFIG_LV_FONT_MONTSERRAT_48=y

# Partition Table Configuration (Custom partitions.csv for OTA)
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# HTTP Server Configuration for OTA Uploads
CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024
CONFIG_HTTPD_MAX_URI_LEN=512
